Revit 2024 API
NurbsSurfaceData.GetKnotsV Method
 Get the list of knots in the v-direction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public IList<double> GetKnotsV()
Visual Basic
Public Function GetKnotsV As IList(Of Double)
Visual C++
public:
IList<double>^ GetKnotsV()
See Also
NurbsSurfaceData Class
Autodesk.Revit.DB Namespace